In [8]:
import pandas as pd
import numpy as np
from sdgym import load_dataset
from sdgym.synthesizers import TVAESynthesizer

In [9]:
# use first 100 rows from cc_data.csv
df = pd.read_csv('data/cc_data.csv')
df = df[:10000]

d:\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3063: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [10]:
# remove unnecessary columns
col2remove = ['SIC Code', 'Return Amount', 'Reward Amount', 'Transaction ID', 
              'Account Identifier', 'Account Name', 'Account Number', 'Bank Name', 
              'Aggregator Name', 'Consumer ID', 'Consumer Created Date',
              'Transaction String',  'Posted Date', 'Data Creation Date', 
              'SIC Description','Consumer Postal Code', 'Consumer City Name',
              'Transaction Type','Transaction Date','Normalized Retailer','Ethnicity']
df.drop(col2remove, axis = 1, inplace = True)

In [11]:
df.head()

   Account Type Consumer Gender  Consumer Birth Year  Purchase Amount
0   credit_card            male                 1998            15.52
1  bank_account            male                 1990            11.29
2   credit_card            male                 1986            10.78
3  bank_account          female                 1977            88.90
4  bank_account            male                 1958            23.54

In [12]:
# drop nan values
df.dropna(inplace = True)
# one hot encoding for categorical variables
df = pd.get_dummies(df)
df.head()

,Consumer Birth Year,Purchase Amount,Account Type_bank_account,Account Type_credit_card,Account Type_investment_account,Consumer Gender_both,Consumer Gender_female,Consumer Gender_male
0,1998,15.52,0,1,0,0,0,1
1,1990,11.29,1,0,0,0,0,1
2,1986,10.78,0,1,0,0,0,1
3,1977,88.90,1,0,0,0,1,0
4,1958,23.54,1,0,0,0,0,1

In [13]:
# convert pd frame to np array and indicate categorical and oridinal columns
data = df.to_numpy()
categorical_columns = [2,3,4,5,6]
ordinal_columns = [0]

In [14]:
# train the synthesizer
synthesizer = TVAESynthesizer()
synthesizer.fit(data, categorical_columns, ordinal_columns)

C:\Users\rzhan\AppData\Roaming\Python\Python37\site-packages\sklearn\mixture\base.py:265: ConvergenceWarning: Initialization 1 did not converge. Try different init parameters, or increase max_iter, tol or check for degenerate data.
  % (init + 1), ConvergenceWarning)
C:\Users\rzhan\AppData\Roaming\Python\Python37\site-packages\sklearn\cluster\k_means_.py:972: ConvergenceWarning: Number of distinct clusters (2) found smaller than n_clusters (10). Possibly due to duplicate points in X.
  return_n_iter=True)

In [67]:
# check out sample
sampled = synthesizer.sample(10)
np.set_printoptions(suppress = True, precision = 2)
print(sampled)

[[1983.     44.1     1.      0.      0.      0.      0.      1.  ]
 [1985.     24.62    1.      0.      0.      0.      1.     -0.  ]
 [1990.     59.29    1.      0.      0.      0.      0.      1.  ]
 [1989.      5.45    0.      1.      0.      0.      1.      0.  ]
 [1985.     36.31    1.      0.      0.      0.      0.      1.  ]
 [1983.      8.44    1.      0.      0.      0.      1.      0.  ]
 [1986.      4.01    1.      0.      0.      0.      1.      0.  ]
 [1990.      9.06    0.      1.      0.      0.      0.      1.  ]
 [1991.      4.18    1.      0.      0.      0.      1.      0.  ]
 [1986.     67.4     1.      0.      0.      0.      1.      0.  ]]